Eu2C/README.org
#                            -*- mode: org; -*-
#+TITLE:                *Eu2C*
#+AUTHOR: nil
#+EMAIL: no-reply
#+OPTIONS: author:nil email:nil ^:{}

* [[file:../COPYING][Copyright]]
  Copyright 1994-2010 Fraunhofer ISST,
  Copyright 2010 Henry G. Weller.

  This file is part of Eu2C.

  Eu2C is free software: you can redistribute it and/or modify it under the
  terms of the GNU General Public License version 2 as published by the Free
  Software Foundation.

  Eu2C is distributed in the hope that it will be useful, but WITHOUT ANY
  WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
  A PARTICULAR PURPOSE.  See the GNU General Public License for more details.

  You should have received a copy of the GNU General Public License along with
  this program in the file [[file:../COPYING][COPYING]].  If not, see <http://www.gnu.org/licenses/>.

* General
  Eu2C was originally developed at Fraunhofer ISST in the joint research project
  APPLY funded by the German Ministry of Research and Technology under the
  project code ITW9102D5.  The final release in July 1994 is publicly available
  from [[http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/others/eulisp/eu2c/v94_07/eu2c.tgz][eu2c.tgz]] however the terms of use are not specified.  This release of
  Eu2C is derived from the eu2c-94-07-EUPL version kindly prepared and provided
  by E. Ulrich Kriegel and released by Fraunhofer ISST under the [[http://www.osor.eu/eupl/european-union-public-licence-eupl-v.1.1][EUPL version
  1.1 ]] (see [[README.orig]]).  However, due to the inclusion of EuLisp code from
  Youtoo, which is released under the GPL version 2, this version of Eu2C
  inherits the GPL version 2 (see above) as specifically permitted under the
  compatibility terms of the EUPL version 1.1.  Future versions of the EUPL may
  include a compatibility clause for GPL version 3 at which point it will be
  possible to re-release Eu2C, Youtoo and EuXLisp under the GPL version 3.

* APPLY
  This section provides a little background about the APPLY project and the
  motivation and design of Eu2C.  The text is predominantly obtained from
  "readme" and announcement files released with Eu2C by Fraunhofer ISST.  These
  are available from the AI repository at CMU: [[http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/others/eulisp/eu2c][eu2c]], see also
  [[http://publica.fraunhofer.de/dokumente/PX-46999.html][Eu2C - Lisp to C
  compiler]].

  There were two main problems for Lisp users being considered at the time:
  1. the efficiency, by which we mean both the run-time efficiency and the
     efficiency of storage use and
  2. the unsatisfactory integration capability of Lisp programs with other
     programs. Our way of solving these problems is to compile Lisp applications
     into C.

  The main goal of APPLY project was to development a Lisp system which
  consistently supports the efficient execution of applications and their
  simple integration into current software environments. The aims of the Eu2C
  development were
  + efficient execution of Lisp applications comparable to that of C-programs
    and
  + simple integration of Lisp programs into non-Lisp environments.

  As a first step Apply/E2C was realized as a total compiler compiling
  EuLisp-Modules into C source code which then must be compiled by an ANSI
  C-compiler.  To implement and describe the runtime system and to achieve high
  performance of the C-programs generated we must have a language that can
  handle C-data types and C-values. For this purpose ISST developed a typed
  Lisp-like implementation language called TAIL. You can describe the
  representation of data, the type schemes and the type lattice with TAIL. Thus
  we have the possibility to carry out experiments with different data
  representations or type schemes without changing the Eu2C-compiler. TAIL can
  also be used as the basis for the implementation of other Lisp dialects. A
  type inference system has a great effect on the speed of Lisp programs. With a
  good type inference system you can reduce the number of dynamic type checks
  and replace calls of generic functions by direct calls of methods. A
  C-compiler has the best results for optimization of C-programs if the
  C-programs look like programs written by experienced programmers.  The ISST
  called this kind of C-code "natural C-code".  The approach is, for example, to
  use the parameter passing mechanism of C instead of using a special Lisp stack
  to achieve very fast function calls.

  To achieve to project goals the following implementation decisions were
  taken:
  - The hardware stack is used instead of an own lisp control stack.
  - Lisp data types are represented similar to C datatypes in order to avoid
    incompatibility with hardwara datatypes and in order to enable easy data
    exchange with non-Lisp programs.
*** Project Partners
    + GMD-FIT (St. Augustin, Germany)
    + Fraunhofer ISST (Berlin, Germany)
    + VW-GEDAS (Berlin, Germany)
    + CAU Kiel (Kiel, Germany)
*** GC
    These decisions require to use a conservative pointer finding strategy for
    gc.

  The implementation comprises EuLisp-0.99 level-0.

*** Compilation strategies
    Two compilation strategies are supported:
    - total compilation of an application including all the runtime modules
    - total compilation of an application using a precompiled runtime system,
      /e.g./ =eulisp-level-0=.

    The former produces very efficient code but the compilation is very cpu-
    intensive. The code produced by the second variant is a little bit less
    efficient since optimization across the interface between application an
    runtime system is not possible, but due to the precompiled runtime-system
    the compilation process is much faster.

*** Threads are supported
    but use setjmp/longjmp rather than pthreads or equivalent so do not
    currently take advantage of multi-core CPUs.

*** Reports and Papers
  + [[ftp://ftp1.fraunhofer.de/archive/gmd/apply][Apply Papers]]
  + [[http://www.isst.fraunhofer.de/publications/isst-berichte/][Fraunhofer
    Reports]]
    Reports in the series ISSN: 0943-1624 relating to APPLY/Eu2C not available
    from the APPLY archive ftp site above:
    18. Friedrich, Horst: „Eu2C-LISP to C Compiler“, Berlin 1994.
        See also http://publica.fraunhofer.de/dokumente/PX-46999.html
    3. Heicking, Winfried; Rosenmüller, Rainer: „Machine description“, Berlin
       1992.
