Eu2C/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>*Eu2C*</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-10-19 20:56:27 BST"/>
<meta name="author" content="nil"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title"><b>Eu2C</b></h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Copyright </a></li>
<li><a href="#sec-2">2 General </a></li>
<li><a href="#sec-3">3 APPLY </a></li>
<li><a href="#sec-4">4 Installation </a></li>
<li><a href="#sec-5">5 Current Limitations </a></li>
<li><a href="#sec-6">6 Common Lisp Compiler Extensions </a></li>
<li><a href="#sec-7">7 Necessary module imports </a></li>
<li><a href="#sec-8">8 Compiler log </a></li>
<li><a href="#sec-9">9 Examples </a></li>
<li><a href="#sec-10">10 To Do </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="../COPYING">Copyright</a> </h2>
<div class="outline-text-2" id="text-1">

<p>Copyright 1994-2010 Fraunhofer ISST,
Copyright 2010 Henry G. Weller.
</p>
<p>
This file is part of Eu2C.
</p>
<p>
Eu2C is free software: you can redistribute it and/or modify it under the
terms of the GNU General Public License version 2 as published by the Free
Software Foundation.
</p>
<p>
Eu2C is distributed in the hope that it will be useful, but WITHOUT ANY
WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR
A PARTICULAR PURPOSE.  See the GNU General Public License for more details.
</p>
<p>
You should have received a copy of the GNU General Public License along with
this program in the file <a href="../COPYING">COPYING</a>.  If not, see <a href="http://www.gnu.org/licenses/">http://www.gnu.org/licenses/</a>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> General </h2>
<div class="outline-text-2" id="text-2">

<p>Eu2C was originally developed at Fraunhofer ISST in the joint research project
APPLY funded by the German Ministry of Research and Technology under the
project code ITW9102D5.  The final release in July 1994 is publicly available
from <a href="http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/others/eulisp/eu2c/v94_07/eu2c.tgz">eu2c.tgz</a> however the terms of use are not specified.  This release of
Eu2C is derived from the eu2c-94-07-EUPL version kindly prepared and provided
by E. Ulrich Kriegel and released by Fraunhofer ISST under the <a href="http://www.osor.eu/eupl/european-union-public-licence-eupl-v.1.1">EUPL version 1.1 </a> (see <a href="#README.orig">README.orig</a>).  However, due to the inclusion of EuLisp code from
Youtoo, which is released under the GPL version 2, this version of Eu2C
inherits the GPL version 2 (see above) as specifically permitted under the
compatibility terms of the EUPL version 1.1.  Future versions of the EUPL may
include a compatibility clause for GPL version 3 at which point it will be
possible to re-release Eu2C, Youtoo and EuXLisp under the GPL version 3.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> APPLY </h2>
<div class="outline-text-2" id="text-3">

<p>This section provides a little background about the APPLY project and the
motivation and design of Eu2C.  The text is predominantly obtained from
"readme" and announcement files released with Eu2C by Fraunhofer ISST.  These
are available from the AI repository at CMU: <a href="http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/others/eulisp/eu2c">eu2c</a>, see also
<a href="http://publica.fraunhofer.de/dokumente/PX-46999.html">Eu2C - Lisp to C compiler</a>.
</p>
<p>
There were two main problems for Lisp users being considered at the time:
</p><ol>
<li>
the efficiency, by which we mean both the run-time efficiency and the
efficiency of storage use and
</li>
<li>
the unsatisfactory integration capability of Lisp programs with other
programs. Our way of solving these problems is to compile Lisp applications
into C.

</li>
</ol>

<p>The main goal of APPLY project was to development a Lisp system which
consistently supports the efficient execution of applications and their
simple integration into current software environments. The aims of the Eu2C
development were
</p><ul>
<li>
efficient execution of Lisp applications comparable to that of C-programs
and
</li>
<li>
simple integration of Lisp programs into non-Lisp environments.

</li>
</ul>

<p>As a first step Apply/E2C was realized as a total compiler compiling
EuLisp-Modules into C source code which then must be compiled by an ANSI
C-compiler.  To implement and describe the runtime system and to achieve high
performance of the C-programs generated we must have a language that can
handle C-data types and C-values. For this purpose ISST developed a typed
Lisp-like implementation language called TAIL. You can describe the
representation of data, the type schemes and the type lattice with TAIL. Thus
we have the possibility to carry out experiments with different data
representations or type schemes without changing the Eu2C-compiler. TAIL can
also be used as the basis for the implementation of other Lisp dialects. A
type inference system has a great effect on the speed of Lisp programs. With a
good type inference system you can reduce the number of dynamic type checks
and replace calls of generic functions by direct calls of methods. A
C-compiler has the best results for optimization of C-programs if the
C-programs look like programs written by experienced programmers.  The ISST
called this kind of C-code "natural C-code".  The approach is, for example, to
use the parameter passing mechanism of C instead of using a special Lisp stack
to achieve very fast function calls.
</p>
<p>
To achieve to project goals the following implementation decisions were
taken:
</p><ul>
<li>
The hardware stack is used instead of an own lisp control stack.
</li>
<li>
Lisp data types are represented similar to C datatypes in order to avoid
incompatibility with hardwara datatypes and in order to enable easy data
exchange with non-Lisp programs.
</li>
</ul>

<ul>
<li id="sec-3_1">Project Partners <br/>
<ul>
<li>
GMD-FIT (St. Augustin, Germany)
</li>
<li>
Fraunhofer ISST (Berlin, Germany)
</li>
<li>
VW-GEDAS (Berlin, Germany)
</li>
<li>
CAU Kiel (Kiel, Germany)
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-3_2">GC <br/>
These decisions require to use a conservative pointer finding strategy for
gc.

<p>
The implementation comprises EuLisp-0.99 level-0.
</p>
</li>
</ul>
<ul>
<li id="sec-3_3">Compilation strategies <br/>
Two compilation strategies are supported:
<ul>
<li>
total compilation of an application including all the runtime modules
</li>
<li>
total compilation of an application using a precompiled runtime system,
<i>e.g.</i> <code>level-0</code>.

</li>
</ul>

<p>The former produces very efficient code but the compilation is very cpu-
intensive. The code produced by the second variant is a little bit less
efficient since optimization across the interface between application an
runtime system is not possible, but due to the precompiled runtime-system
the compilation process is much faster.
</p>
</li>
</ul>
<ul>
<li id="sec-3_4">Threads are supported <br/>
but use setjmp/longjmp rather than pthreads or equivalent so do not
currently take advantage of multi-core CPUs.

</li>
</ul>
<ul>
<li id="sec-3_5">Reports and Papers <br/>
<ul>
<li>
<a href="ftp://ftp1.fraunhofer.de/archive/gmd/apply">Apply Papers</a>
</li>
<li>
<a href="http://www.isst.fraunhofer.de/publications/isst-berichte/">Fraunhofer Reports</a>
Reports in the series ISSN: 0943-1624 relating to APPLY/Eu2C not available
from the APPLY archive ftp site above:
<ol>
<li>
Friedrich, Horst: „Eu2C-LISP to C Compiler“, Berlin 1994.
See also <a href="http://publica.fraunhofer.de/dokumente/PX-46999.html">http://publica.fraunhofer.de/dokumente/PX-46999.html</a>
</li>
<li>
Heicking, Winfried; Rosenmüller, Rainer: „Machine description“, Berlin
1992.
</li>
</ol>
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-3_6">See Also <br/>
<ul>
<li>
