Eu2C/README.org
*** See Also
    + [[http://publica.fraunhofer.de/dokumente/PX-46999.html][Fraunhofer Eu2C Abstract]]
    + [[http://www.informatik.uni-kiel.de/~wg/apply.html][CLiCC]]
    + [[http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/others/eulisp/eu2c][AI_Repository]]
    + [[http://www-cgi.cs.cmu.edu/Groups/AI/lang/others/eulisp/eu2c/][AI Repository 2]]
    + [[http://www.rhinocerus.net/forum/lang-lisp/47271-need-help-building-eu2c.html][Previous compilation attempt]]
* Installation
*** Requirements to install and run the EuLisp->C compiler
***** CMUCL Common Lisp compiler
      Tested with version 20a but older should work.

      Note that originally Eu2C used Franz Allegro 4.1 or 4.2 but the current
      8.2 release is unable to compile Eu2C apparently due to some serious bugs
      in in Allegro-8.2.

      Note also than currently Eu2C cannot be compiled with SBCL due to a
      bug/limitation in the way it supports class aliasing, see
      [[https://bugs.launchpad.net/sbcl/+bug/618387][bug-report]].  Once this
      issue is resolved SBCL support will be finalised.

      No attempt has been made to support CLisp as the Common Lisp compiler for
      Eu2C but the indications are that this should be possible with a modest
      amount of work.

***** GNU c compiler gcc
      Tested with version gcc-4.4.3 but older and newer should work.

*** Installation Procedure
    + Pull the latest version from the GitHub repository:
      - =git clone git://github.com/Henry/EuLisp.git=
    + "cd" into the =EuLisp/Eu2C= directory.
    + Define an environment variable Eu2CROOT to be the path of the
      distribution directory:
      - =export Eu2CROOT=`pwd`=
    + For complete installation, run the command make without any arguments,
      which takes depending on your hardware a few minutes.
      The following will happen:
      - CMUCL starts and the source files of the eu2c-compiler will be compiled.
      - CMUCL starts again, reads the compiled compiler sources and creates a
        new image containing the EuLisp->C-compiler.  If you have defined an
        environment variable Eu2CIMAGENAME, the value of that variable will be
        used as the new name of the CMUCL image with the eu2c compiler loaded,
        otherwise the name will be =Lib/eu2c.cmu=.
      - The libraries with different incarnations of Mem4C, an application
        independent conservative garbage collector will be created.
      - The eu2c-compiler is started first time to compile the basic module
        which is in the default case the module =eulisp-level-0=.
      - The eu2c-compiler is started again to be enhanced with the precompiled
        eulisp-level-0 module. A new CMUCL image is created. Its name is
        composed of the name of the eu2c-compiler and the name of the basic
        module. Therefore, he default name will be
        =Lib/eu2c.eulisp-level-0.cmu=.
*** Compilation of EuLisp-Modules
    There are 2 different strategies for the compilation of EuLisp modules:
    + total compilation of an application including all the runtime modules
    + total compilation of an application using a precompiled runtime system,
      /e.g./ =eulisp-level-0=.

    The former produces very efficient code but the compilation is very cpu-
    intensive. The code produced by the second variant is a little bit less
    efficient since optimization across the interface between application an
    runtime system is not possible, but due to the precompiled runtime-system
    the compilation process is much faster.

    A general compiler-driver =Bin/eu2c= is provided which controls the
    compilation process.  In order to compile an EuLisp Module into C and then
    create an application simply call:
    + =Bin/eu2c [switches] <path expression> [C-compiler switches and additional
    C files]=
    /e.g./ in the =Examples= sub-directory
    + =../Bin/eu2c -bs eulisp-level-0 hello=

    The compilation of the EuLisp-module =hello.em= with precompiled runtime
    system is started. The following files will be created:
    + hello.c    : the C code
    + hello.inst : description of instances, will be included from =hello.c=
    + hello      : image

    The following switches are of special interest:
    + =-C= : compiles and links the C code of the EuLisp-module (a somewhat
      specialized driver for ANSI-C compiler and Linker)
    + =-L= : compiles the given EuLisp-module to C and stops (runs the Eu2C
      compiler only).
    + Omitting both =-L= and =-C= will call the Eu2C compiler first nad then the
      ANSI-C compiler and linker to produce an application.
    + =-g= : sets the debug-Option for the C-compiler and suppress all C-level
      optimizations
    + =-bs <name>= : use the precompiled runtime-system with name <name> for
      compilation The default is without precompiled runtime system, /i.e./ all
      run-time system modules needed system is compiled together with the
      application. As a tradeoff between compilation time and run-time we
      strongly recommend to use a precompiled run-time system for
      compilation. There is a module =eulisp-level-0= containing everything
      defined in =level-0= of EuLisp-0.99. In addition we provide a module
      =eulis0x= which exposes =eulisp-level-0= and contains the following
      enhancements: command-line-interface and the base of an interface to C.
    + =-security= : Links with a gc-library which is compiled with special
      security features. In the default case a gc-library with security features
      off is used.
    + =-threads= : The precompiled run-time system =eulisp-level0= supports
      threads.  However, threads require special care during memory management
      activities like allocation of space. For the sake of efficiency we decided
      to assume as a default case that there are single threaded applications
      only. If one insist to use threads then one has to use the =-threads=
      switch which ensures that the correct gc-library will be linked to your
      application. (Using that library with single threaded applications would
      reduce the application efficiency by about 10%).
    + =-cards <start number of cards>= : Eu2C relies on a conservative memory
      management system Mem4C[++], which allocates memory portions on cards of
      size 4096 bytes.  The switch =-cards= determines the initial number of
      cards allocated during system initialization.  As a default we use a value
      of 16. That means one starts with a heap size of 64 kBytes which will be
      increased on demand in correspondence with the configuration of the
      Mem4C[++]-library.
*** Examples
    In the subdirectory $Eu2CROOT/Examples some example EuLisp programs are
    given, some of them require to be compiled with the module =eulisp-level-0=
    and some must be compiled with the =eulisp0x=-module.

    A basic system with precompiled =eulisp0x= can be generated by calling make
    with:
    + =make basic_module=eulisp0x=

    and used thus:
    + cd Examples
    + ../Bin/eu2c -bs eulisp0x command-line
