Eu2C/README.html
<a href="http://publica.fraunhofer.de/dokumente/PX-46999.html">Fraunhofer Eu2C Abstract</a>
</li>
<li>
<a href="http://www.informatik.uni-kiel.de/~wg/apply.html">CLiCC</a>
</li>
<li>
<a href="http://www.cs.cmu.edu/afs/cs/project/ai-repository/ai/lang/others/eulisp/eu2c">AI_Repository</a>
</li>
<li>
<a href="http://www-cgi.cs.cmu.edu/Groups/AI/lang/others/eulisp/eu2c/">AI Repository 2</a>
</li>
<li>
<a href="http://www.rhinocerus.net/forum/lang-lisp/47271-need-help-building-eu2c.html">Previous compilation attempt</a>
</li>
</ul>

</li>
</ul>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Installation </h2>
<div class="outline-text-2" id="text-4">

<ul>
<li id="sec-4_1">Requirements to install and run the EuLisp-&gt;C compiler <br/>
<ul>
<li id="sec-4_1_1">CMUCL Common Lisp compiler <br/>
Tested with version 20a but older should work.

<p>
Note that originally Eu2C used Franz Allegro 4.1 or 4.2 but the current
8.2 release is unable to compile Eu2C apparently due to some serious bugs
in in Allegro-8.2.
</p>
<p>
Note also than currently Eu2C cannot be compiled with SBCL due to a
bug/limitation in the way it supports class aliasing, see
<a href="https://bugs.launchpad.net/sbcl/+bug/618387">bug-report</a>.  Once this
issue is resolved SBCL support will be finalised.
</p>
<p>
No attempt has been made to support CLisp as the Common Lisp compiler for
Eu2C but the indications are that this should be possible with a modest
amount of work.
</p>
</li>
</ul>
<ul>
<li id="sec-4_1_2">GNU c compiler gcc <br/>
Tested with version gcc-4.4.3 but older and newer should work.

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-4_2">Installation Procedure <br/>
<ul>
<li>
Pull the latest version from the GitHub repository:
<ul>
<li>
<code>git clone git://github.com/Henry/EuLisp.git</code>
</li>
</ul>
</li>
<li>
"cd" into the <code>EuLisp/Eu2C</code> directory.
</li>
<li>
Define an environment variable Eu2CROOT to be the path of the
distribution directory:
<ul>
<li>
<code>export Eu2CROOT=`pwd`</code>
</li>
</ul>
</li>
<li>
For complete installation, run the command make without any arguments,
which takes depending on your hardware a few minutes.
The following will happen:
<ul>
<li>
CMUCL starts and the source files of the eu2c-compiler will be compiled.
</li>
<li>
CMUCL starts again, reads the compiled compiler sources and creates a
new image containing the EuLisp-&gt;C-compiler.  If you have defined an
environment variable Eu2CIMAGENAME, the value of that variable will be
used as the new name of the CMUCL image with the eu2c compiler loaded,
otherwise the name will be <code>Lib/eu2c.cmu</code>.
</li>
<li>
The libraries with different incarnations of Mem4C, an application
independent conservative garbage collector will be created.
</li>
<li>
The eu2c-compiler is started first time to compile the basic module
which is in the default case the module <code>level-0</code>.
</li>
<li>
The eu2c-compiler is started again to be enhanced with the precompiled
level-0 module. A new CMUCL image is created. Its name is
composed of the name of the eu2c-compiler and the name of the basic
module. Therefore, he default name will be
<code>Lib/eu2c.level-0.cmu</code>.
</li>
</ul>
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-4_3">Compilation of EuLisp-Modules <br/>
There are 2 different strategies for the compilation of EuLisp modules:
<ul>
<li>
total compilation of an application including all the runtime modules
</li>
<li>
total compilation of an application using a precompiled runtime system,
<i>e.g.</i> <code>level-0</code>.

</li>
</ul>

<p>The former produces very efficient code but the compilation is very cpu-
intensive. The code produced by the second variant is a little bit less
efficient since optimization across the interface between application an
runtime system is not possible, but due to the precompiled runtime-system
the compilation process is much faster.
</p>
<p>
A general compiler-driver <code>Bin/eu2c</code> is provided which controls the
compilation process.  In order to compile an EuLisp Module into C and then
create an application simply call:
</p><ul>
<li>
=Bin/eu2c [switches] &lt;path expression&gt; [C-compiler switches and additional
</li>
</ul>

<p>C files]=
<i>e.g.</i> in the <code>Examples</code> sub-directory
</p><ul>
<li>
<code>../Bin/eu2c -bs level-0 hello</code>

</li>
</ul>

<p>The compilation of the EuLisp-module <code>hello.em</code> with precompiled runtime
system is started. The following files will be created:
</p><ul>
<li>
hello.c    : the C code
</li>
<li>
hello.inst : description of instances, will be included from <code>hello.c</code>
</li>
<li>
hello      : image

</li>
</ul>

<p>The following switches are of special interest:
</p><ul>
<li>
<code>-C</code> : compiles and links the C code of the EuLisp-module (a somewhat
specialized driver for ANSI-C compiler and Linker)
</li>
<li>
<code>-L</code> : compiles the given EuLisp-module to C and stops (runs the Eu2C
compiler only).
</li>
<li>
Omitting both <code>-L</code> and <code>-C</code> will call the Eu2C compiler first nad then the
ANSI-C compiler and linker to produce an application.
</li>
<li>
<code>-g</code> : sets the debug-Option for the C-compiler and suppress all C-level
optimizations
</li>
<li>
<code>-bs &lt;name&gt;</code> : use the precompiled runtime-system with name &lt;name&gt; for
compilation The default is without precompiled runtime system, <i>i.e.</i> all
run-time system modules needed system is compiled together with the
application. As a tradeoff between compilation time and run-time we
strongly recommend to use a precompiled run-time system for
compilation. There is a module <code>level-0</code> containing everything
defined in <code>level-0</code> of EuLisp-0.99. In addition we provide a module
<code>eulis0x</code> which exposes <code>level-0</code> and contains the following
enhancements: command-line-interface and the base of an interface to C.
</li>
<li>
<code>-security</code> : Links with a gc-library which is compiled with special
security features. In the default case a gc-library with security features
off is used.
</li>
<li>
<code>-threads</code> : The precompiled run-time system <code>eulisp-level-0</code> supports
threads.  However, threads require special care during memory management
activities like allocation of space. For the sake of efficiency we decided
to assume as a default case that there are single threaded applications
only. If one insist to use threads then one has to use the <code>-threads</code>
switch which ensures that the correct gc-library will be linked to your
application. (Using that library with single threaded applications would
reduce the application efficiency by about 10%).
</li>
<li>
<code>-cards &lt;start number of cards&gt;</code> : Eu2C relies on a conservative memory
management system Mem4C[++], which allocates memory portions on cards of
size 4096 bytes.  The switch <code>-cards</code> determines the initial number of
cards allocated during system initialization.  As a default we use a value
of 16. That means one starts with a heap size of 64 kBytes which will be
increased on demand in correspondence with the configuration of the
Mem4C[++]-library.
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-4_4">Examples <br/>
In the subdirectory $Eu2CROOT/Examples some example EuLisp programs are
given, some of them require to be compiled with the module <code>level-0</code>
and some must be compiled with the <code>level-0x</code>-module.

<p>
A basic system with precompiled <code>level-0x</code> can be generated by calling make
with:
</p><ul>
<li>
<code>make basic_module=level-0x</code>

</li>
</ul>

<p>and used thus:
</p><ul>
<li>
cd Examples
</li>
<li>
../Bin/eu2c -bs level-0x command-line
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-4_5">Makefile <br/>
