Eu2C/README.org
*** Makefile
    For the easy installation we provide a script for make. The following macros
    are used:
    + =basic_image=: The name of the CMUCL image containing the eu2c
      compiler. If the environment variable =$Eu2CIMAGENAME= is defined, its
      value will be used, otherwise the name is assumed to be =eu2c.cmu=.
    + =basic_module=: The name of the EuLisp-module which contain the basic
      run-time system. The default value is =eulisp-level-0=. Another possible
      basic module is =eulisp0x=.

    The following targets for make are defined:

    + =basic_system=: compiles the basic run-time-system and creates a new
      CMUCL-image with basic run-time system loaded.
    + =compile_basic_system=: compiles a basic-run-time system.
    + =load_basic_system=: loads a pre-compiled run-time system and builds a new
      CMUCL-image with that system pre-compiled.
    + =<basic_image>=: compiles all compiler sources, loads them and creates an
      CMUCL- image with name =<basic_image>= which contains the pure eu2c
      compiler without any precompiled run-time resources.
    + =libs=: creates the libraries for the memory management system.
    + =clean_basic_system=: removes the pre-compiled run-time system and
      CMUCL-image containing precompiled run-time system (approximately 16MB)
    + =clean_compiler_sources=: deletes all source files of the eu2c compiler.
    + =clean_run-time_sources=: deletes the eulisp source files of the run-time
      system.
    + =clean_eu2c_image=: deletes the CMUCL-image containing the eu2c-compiler.
    + =clean_libs=: deletes the libraries for the memory management system.
    + =clean_c_sources=: deletes all c source files of the memory management
    system.
    + =remove_sources=: removes all sources. Should only be used if you have
    created an CMUCL-image with a precompiled run-time system.

    If you plan to use Eu2C with the precompiled basic system we recommend to
    run make with the targets clean_runtime_sources and clean_eu2c_image.
*** Building 32bit on a 64bit machine:
    It is possible to compile 32bit on 64bit machines using the "WL=32" option
    to build the run-time and the -m32 option when building the applications,
    e.g.
    + make clean
    + make WL=32
    + cd Examples
    + ../Bin/eu2c -m32 -bs eulisp-level-0 gtakl2
    + ./gtakl2
* Current Limitations
*** Not yet implemented:
    + =generic-lambda=.
    + =scan=: the function read can be used instead.
*** Not yet complete:
    + =format=: the directives =~e=, =~f= and =~g= are not yet present.
*** Known problems:
    + Symbol case: During compilation (when the modules are read in) the symbol
      identifiers are converted into upper case.  However, at run time read
      distinguishes for symbols between upper and lower cases.
    + See 9.4. in EuLisp-0.99: The module itself can not be referenced in an
      expose directive of a module.
    + See 9.5 in EuLisp-0.99: The syntax imports of special forms and standard
      macros is not yet supported.  Currently they are treated in a special way.
    + Numeric errors can be captured using =with-handler= but they are not
      continuable.
    + An endless recursion in which the recursive call is on the top of the
      function level is incorrect:
      - =(defun loop () ... (loop))=

      But in all other cases the right code is generated:
      #+BEGIN_SRC eulisp
      (defun loop ()
        (if ... (progn ... (loop))
          (progn ... (loop))))
      #+END_SRC
    + Tables can not currently be used.

* Common Lisp Compiler Extensions
  It is necessary to extend the capabilities of the CL compiler to support:
  + keyword symbols which end in a ":", this is formally allowed by the CL
    standard as an implementation-dependent extension;
  + "e" as the exponent designator for written double-precision numbers, the CL
    standard specifies either "d" or "D".

  Eu2C now includes a patch file [[file:Apply/cmu.lisp]] which adds support for
  both of the above into the CMUCL-20a/b CL compiler.  The equivalent would have
  to be created for other CL implementations e.g. SBCL or CLisp if they are to
  be used to compile Eu2C.

* Necessary module imports
  The whole functionality of level 0 of EuLisp is contained in the module
  =eulisp-level-0=. Therefore the module =eulisp-level-0= should be imported
  as in the following example.
  #+BEGIN_SRC eulisp
  (defmodule test-module
    (import (eulisp-level-0 user-module)
     syntax (eulisp-level-0 user-module-with-macro-definition)
     export (fct1 fct2 ...)
     expose (...))
    .
    .
    .
    )
  #+END_SRC

