Eu2C/README.html
For the easy installation we provide a script for make. The following macros
are used:
<ul>
<li>
<code>basic_image</code>: The name of the CMUCL image containing the eu2c
compiler. If the environment variable <code>$Eu2CIMAGENAME</code> is defined, its
value will be used, otherwise the name is assumed to be <code>eu2c.cmu</code>.
</li>
<li>
<code>basic_module</code>: The name of the EuLisp-module which contain the basic
run-time system. The default value is <code>level-0</code>. Another possible
basic module is <code>level-0x</code>.

</li>
</ul>

<p>The following targets for make are defined:
</p>
<ul>
<li>
<code>basic_system</code>: compiles the basic run-time-system and creates a new
CMUCL-image with basic run-time system loaded.
</li>
<li>
<code>compile_basic_system</code>: compiles a basic-run-time system.
</li>
<li>
<code>load_basic_system</code>: loads a pre-compiled run-time system and builds a new
CMUCL-image with that system pre-compiled.
</li>
<li>
<code>&lt;basic_image&gt;</code>: compiles all compiler sources, loads them and creates an
CMUCL- image with name <code>&lt;basic_image&gt;</code> which contains the pure eu2c
compiler without any precompiled run-time resources.
</li>
<li>
<code>libs</code>: creates the libraries for the memory management system.
</li>
<li>
<code>clean_basic_system</code>: removes the pre-compiled run-time system and
CMUCL-image containing precompiled run-time system (approximately 16MB)
</li>
<li>
<code>clean_compiler_sources</code>: deletes all source files of the eu2c compiler.
</li>
<li>
<code>clean_run-time_sources</code>: deletes the eulisp source files of the run-time
system.
</li>
<li>
<code>clean_eu2c_image</code>: deletes the CMUCL-image containing the eu2c-compiler.
</li>
<li>
<code>clean_libs</code>: deletes the libraries for the memory management system.
</li>
<li>
<code>clean_c_sources</code>: deletes all c source files of the memory management
</li>
</ul>

<p>system.
</p><ul>
<li>
<code>remove_sources</code>: removes all sources. Should only be used if you have
</li>
</ul>

<p>created an CMUCL-image with a precompiled run-time system.
</p>
<p>
If you plan to use Eu2C with the precompiled basic system we recommend to
run make with the targets clean_runtime_sources and clean_eu2c_image.
</p></li>
</ul>
<ul>
<li id="sec-4_6">Building 32bit on a 64bit machine: <br/>
It is possible to compile 32bit on 64bit machines using the <code>ARCH=i686</code>
option to build the run-time and the <code>-arch i686</code> option when building the
applications, e.g.
<ul>
<li>
<code>make clean</code>
</li>
<li>
<code>make ARCH=i686</code>
</li>
<li>
<code>cd Examples</code>
</li>
<li>
<code>../Bin/eu2c -arch i686 -bs level-0 gtakl2</code>
</li>
<li>
<code>./gtakl2</code>
</li>
</ul>

</li>
</ul>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Current Limitations </h2>
<div class="outline-text-2" id="text-5">

<ul>
<li id="sec-5_1">Not yet implemented: <br/>
<ul>
<li>
<code>generic-lambda</code>.
</li>
<li>
<code>scan</code>: the function read can be used instead.
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-5_2">Not yet complete: <br/>
<ul>
<li>
<code>format</code>: the directives <code>~e</code>, <code>~f</code> and <code>~g</code> are not yet present.
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-5_3">Known problems: <br/>
<ul>
<li>
Symbol case: During compilation (when the modules are read in) the symbol
identifiers are converted into upper case.  However, at run time read
distinguishes for symbols between upper and lower cases.
</li>
<li>
See 9.4. in EuLisp-0.99: The module itself can not be referenced in an
expose directive of a module.
</li>
<li>
See 9.5 in EuLisp-0.99: The syntax imports of special forms and standard
macros is not yet supported.  Currently they are treated in a special way.
</li>
<li>
Numeric errors can be captured using <code>with-handler</code> but they are not
continuable.
</li>
<li>
An endless recursion in which the recursive call is on the top of the
function level is incorrect:
<ul>
<li>
<code>(defun loop () ... (loop))</code>

</li>
</ul>
</li>
</ul>

<p>But in all other cases the right code is generated:
</p>


<pre class="src src-eulisp">(defun <span style="color: #0000ff; font-weight: bold;">loop</span> ()
  (if ... (progn ... (<span style="color: #0000ff; font-weight: bold;">loop</span>))
    (progn ... (<span style="color: #0000ff; font-weight: bold;">loop</span>))))
</pre>


<ul>
<li>
Tables can not currently be used.
</li>
</ul>


</li>
</ul>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Common Lisp Compiler Extensions </h2>
<div class="outline-text-2" id="text-6">

<p>It is necessary to extend the capabilities of the CL compiler to support:
</p><ul>
<li>
keyword symbols which end in a ":", this is formally allowed by the CL
standard as an implementation-dependent extension;
</li>
<li>
"e" as the exponent designator for written double-precision numbers, the CL
standard specifies either "d" or "D".

</li>
</ul>

<p>Eu2C now includes a patch file <a href="Apply/cmu.lisp">Apply/cmu.lisp</a> which adds support for
both of the above into the CMUCL-20a/b CL compiler.  The equivalent would have
to be created for other CL implementations e.g. SBCL or CLisp if they are to
be used to compile Eu2C.
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Necessary module imports </h2>
<div class="outline-text-2" id="text-7">

<p>The whole functionality of level 0 of EuLisp is contained in the module
<code>level-0</code>. Therefore the module <code>level-0</code> should be imported
as in the following example.
</p>


<pre class="src src-eulisp">(defmodule <span style="color: #0000ff; font-weight: bold;">test-module</span>
  (<span style="color: #0000ff; font-weight: bold;">import</span> (<span style="color: #0000ff; font-weight: bold;">level-0</span> user-module)
   <span style="color: #0000ff; font-weight: bold;">syntax</span> (<span style="color: #0000ff; font-weight: bold;">level-0</span> user-module-with-macro-definition)
   <span style="color: #0000ff; font-weight: bold;">export</span> (<span style="color: #0000ff; font-weight: bold;">fct1</span> fct2 ...)
   <span style="color: #0000ff; font-weight: bold;">expose</span> (<span style="color: #0000ff; font-weight: bold;">...</span>))
  .
  .
  .
  )
</pre>



</div>

</div>
