Eu2C/README.org
* Compiler log
  =../Bin/eu2c -bs eulisp-level-0 hello= generates (comments are enclosed in
  <<...>>):
  #+BEGIN_SRC eulisp
  Eu2C: (compile-application hello)
        using compiler image /home/dm2/henry/EuLisp/Eu2C/Eu2C/Lib/eu2c.eulisp-level-0

  <<After the creation of the '.c' and '.inst' files the compilation and linking
    of the C-sources with the help of the GNU-C-Compilers is made:>>

  Eu2C: successful conversion of hello.em to hello.c

  + gcc -m64 -c -o hello.o -O2 -I /home/dm2/henry/EuLisp/Eu2C/Eu2C/Runtime hello.c
  + gcc -m64 -z muldefs -o hello -O2 -I /home/dm2/henry/EuLisp/Eu2C/Eu2C/Runtime hello.o /home/dm2/henry/EuLisp/Eu2C/Eu2C/Runtime/eulisp-level-0.a /home/dm2/henry/EuLisp/Eu2C/Eu2C/Runtime/platforms/x86_64m64/eu2c.a -lm
  + set +x

  <<In this phase warnings may appear both from the compiler and the linker. In
    most cases these warnings have no effects on the run of the generated
    program.>>

  DONE

  <<Now you can call the program with:>>

  ./hello

  #+END_SRC

  and the log file hello.log:
  #+BEGIN_SRC eulisp
  *
  NIL
  *
  --- loading application modules
  ;loading module hello.em
  ;apply module HELLO loaded

  <<all user modules are loaded>>

  --- handle symbol environment...
  --- computing discriminating functions...

  <<the discriminating functions of the generic functions are computed>>

  --- marking all exported bindings...
  --- converting to MZS

  <<conversion into a machine level intermediate language>>

  SsssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssS

  <<s shows that the side effect analysis of functions is made,
    S shows the summary of the analysis results>>

  *********************************************************************

  <<each star or point shows the treatment of a function;
    i means in-line was made;
    b means the types within the type inference of
    the functions are balanced>>

  Reduce type schemes of statements ... done.
  Reduce type schemes of functions ... done.
  Convert type schemes to range and domain vectors ... done.
  --- converting MZS to LZS...

  <<conversion from the machine level intermediate language into the Lisp-level
    intermediate language>>

  --- generating C-code
  hello.c...
  hello.inst...
  --- end of compilation ---

  Total number of analysed function calls: 744
  Total number of joined function call descriptors: 0 (0.00 %)

  Total number of inferred function type schemes: 67
  Total number of joined type scheme descriptors: 28 (41.79 %)

  Total number of inferred classes: 2125
  Total number of inferred abstract classes: 0 (0.00 %)

  <<analysis statistics which show the number of analyzed functions, the number
    of infered classes. It is also printed the percentage of abstract classes;
    the less the number of abstract classes the more the number of instantiable
    classes.>>

  "end of compilation"
  *
  #+END_SRC

