Eu2C/README.html

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Compiler log </h2>
<div class="outline-text-2" id="text-8">

<p><code>../Bin/eu2c -bs level-0 hello</code> generates (comments are enclosed in
<a name="&hellip;" class="target">&hellip;</a> ):
</p>


<pre class="src src-eulisp"><span style="color: #000000;">Eu2C:</span> (<span style="color: #0000ff; font-weight: bold;">compile-application</span> hello)
      using compiler image /home/dm2/henry/EuLisp/Eu2C/Eu2C/Lib/eu2c.level-0

&lt;&lt;After the creation of the '.c' and '.inst' files the compilation and linking
  of the <span style="color: #000000;">C-sources</span> with the help of the <span style="color: #000000;">GNU-C-Compilers</span> is made:&gt;&gt;

<span style="color: #000000;">Eu2C:</span> successful conversion of hello.em to hello.c

+ gcc -m64 -c -o hello.o -O2 -I /home/dm2/henry/EuLisp/Eu2C/Eu2C/Runtime hello.c
+ gcc -m64 -z muldefs -o hello -O2 -I /home/dm2/henry/EuLisp/Eu2C/Eu2C/Runtime hello.o /home/dm2/henry/EuLisp/Eu2C/Eu2C/Runtime/level-0.a /home/dm2/henry/EuLisp/Eu2C/Eu2C/Runtime/platforms/x86_64m64/eu2c.a -lm
+ set +x

&lt;&lt;In this phase warnings may appear both from the compiler and the linker. <span style="color: #000000;">In</span>
  most cases these warnings have no effects on the run of the generated
  program.&gt;&gt;

<span style="color: #000000;">DONE</span>

&lt;&lt;Now you can call the program with:&gt;&gt;

./hello

</pre>



<p>
and the log file hello.log:
</p>


<pre class="src src-eulisp">*
<span style="color: #000000;">NIL</span>
*
--- loading application modules
<span style="color: #ff00ff; font-weight: bold;">;</span><span style="color: #ff00ff;">loading module hello.em
</span><span style="color: #ff00ff; font-weight: bold;">;</span><span style="color: #ff00ff;">apply module HELLO loaded
</span>
&lt;&lt;all user modules are loaded&gt;&gt;

--- handle symbol environment...
--- computing discriminating functions...

&lt;&lt;the discriminating functions of the generic functions are computed&gt;&gt;

--- marking all exported bindings...
--- converting to <span style="color: #000000;">MZS</span>

&lt;&lt;conversion into a machine level intermediate language&gt;&gt;

<span style="color: #000000;">SsssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssS</span>

&lt;&lt;s shows that the side effect analysis of functions is made,
  <span style="color: #000000;">S</span> shows the summary of the analysis results&gt;&gt;

<span style="font-weight: bold; text-decoration: underline;">*********************************************************************</span>

&lt;&lt;each star or point shows the treatment of a function<span style="color: #ff00ff; font-weight: bold;">;</span><span style="color: #ff00ff;">
</span>  i means in-line was made<span style="color: #ff00ff; font-weight: bold;">;</span><span style="color: #ff00ff;">
</span>  b means the types within the type inference of
  the functions are balanced&gt;&gt;

<span style="color: #000000;">Reduce</span> type schemes of statements ... done.
<span style="color: #000000;">Reduce</span> type schemes of functions ... done.
<span style="color: #000000;">Convert</span> type schemes to range and domain vectors ... done.
--- converting <span style="color: #000000;">MZS</span> to <span style="color: #000000;">LZS...</span>

&lt;&lt;conversion from the machine level intermediate language into the <span style="color: #000000;">Lisp-level</span>
  intermediate language&gt;&gt;

--- generating <span style="color: #000000;">C-code</span>
hello.c...
hello.inst...
--- end of compilation ---

<span style="color: #000000;">Total</span> number of analysed function calls: 744
<span style="color: #000000;">Total</span> number of joined function call descriptors: 0 (<span style="color: #0000ff; font-weight: bold;">0.00</span> %)

<span style="color: #000000;">Total</span> number of inferred function type schemes: 67
<span style="color: #000000;">Total</span> number of joined type scheme descriptors: 28 (<span style="color: #0000ff; font-weight: bold;">41.79</span> %)

<span style="color: #000000;">Total</span> number of inferred classes: 2125
<span style="color: #000000;">Total</span> number of inferred abstract classes: 0 (<span style="color: #0000ff; font-weight: bold;">0.00</span> %)

&lt;&lt;analysis statistics which show the number of analyzed functions, the number
  of infered classes. <span style="color: #000000;">It</span> is also printed the percentage of abstract classes<span style="color: #ff00ff; font-weight: bold;">;</span><span style="color: #ff00ff;">
</span>  the less the number of abstract classes the more the number of instantiable
  classes.&gt;&gt;

<span style="color: #00ff00;">"end of compilation"</span>
*
</pre>



</div>

</div>
