Eu2C/README.org
* Examples
  In module =takl= (contained in the Examples directory) the functions =takl=
  and =gtakl= are defined and exported. =takl= is a simple function without
  generic functions, =gtakl= is written with the generic function =gshorterp=.
  With the import of the module =eulisp-level-0= the whole functionality of
  level-0 of EuLisp is given.

  The file associated with the module =takl= has to have the name =takl.em=.
  #+BEGIN_SRC eulisp
    (defmodule takl              ; definition of module takl
        (import (eulisp-level-0)
         syntax (eulisp-level-0)
         export (takl gtakl)     ; export of functions takl and gtakl
         )

      (defun shorterp (x y)      ;auxiliary function for takl
        (if (null y )            ;without generic
            ()
          (if  (null x) t
            (shorterp (cdr x)
                      (cdr y))) ))

      (defun takl (x y z)
        (if (null (shorterp y x))
            z
          (takl (takl (cdr x) y z)
                (takl (cdr y) z x)
                (takl (cdr z) x y))))

    ;;;-----------------------------------------------------------------------------
    ;;; takl with generic shorterp
    ;;;-----------------------------------------------------------------------------
      (defgeneric gshorterp ((x <list>) y)) ;auxiliary generic function for gtakl

      (defmethod gshorterp ((x <null>) y)
        y)

      (defmethod gshorterp ((x <cons>) y)
        (if (null y)
            ()
          (gshorterp (cdr x) (cdr y))))

      (defun gtakl (x y z)
        (if (null (gshorterp y x))
            z
          (gtakl (gtakl (cdr x) y z)
                 (gtakl (cdr y) z x)
                 (gtakl (cdr z) x y))))

    ;;;-----------------------------------------------------------------------------
      )                     ; end of module
    ;;;-----------------------------------------------------------------------------
  #+END_SRC

  The next example shows an interface to C to measure run time of functions
  =takl= and =gtakl= imported from the module =takl=. You can see the special
  keyword =c-import= which imports the C-file =timing.c= contained in the
  currend release.  The linking of the C-functions =start_timer= and =timer= was
  made with help of the form =%declare-external-function=. In this form the
  names of this function in EuLisp and in C and the types for the arguments and
  result in C are declared.

  The file associated with the module =test-takl= has to have the name
  =test-takl.em=.

  #+BEGIN_SRC eulisp
    (defmodule test-takl
        (import (eulisp-level-0
                 (only (%void
                        %string)
                       tail)
                 takl)
         syntax (eulisp-level-0)
         c-import ("timing.h")      ;extension of module syntax
         )

      (defun listn (n)
        (if (= n 0)
            ()
          (cons n (listn (- n 1)))))

      (deflocal l24 (listn 24))
      (deflocal l18 (listn 18))
      (deflocal l12 (listn 12))
      (deflocal l6 (listn 6))

      ;;declaration of external functions called from EuLisp
      ;;to measure cpu consumption
      ;;start_timer sets the first time stamp
      ;;timer gets a char * string containing format directives
      ;;to print the values of elapsed user time system time and their sum
      ;;char* strings has to be  written as Tail-literals in the following
      ;;form: (%literal %string () "string")

      (%declare-external-function

        (start-timer %void)          ; the name of the function is start-timer,
        ; result of start-timer is void
        ()                           ; no args
        external-name |start_timer|  ; the name in C is start_timer
        language C)                  ; the used foreign language is C

      (%declare-external-function

        (timer %void)                ; the name of the function is timer
        ; result of timer is void
        ((string %string))           ; one arg string of type char *
        external-name |timer|        ; the name in C is timer
        language C)                  ; the used foreign language is C

      (deflocal result ())

      (start-timer)
      (setq result (takl l24 l12 l6))
      (timer (%literal %string () "\ntakl: %.2f sec (%.2f sec system)"))
      (format t "~%(takl l24 l12 l6) -> ~a~%" result)

    ;;;-----------------------------------------------------------------------------
      )
    ;;;-----------------------------------------------------------------------------
  #+END_SRC
