Eu2C/README.html

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Examples </h2>
<div class="outline-text-2" id="text-9">

<p>In module <code>takl</code> (contained in the Examples directory) the functions <code>takl</code>
and <code>gtakl</code> are defined and exported. <code>takl</code> is a simple function without
generic functions, <code>gtakl</code> is written with the generic function <code>gshorterp</code>.
With the import of the module <code>level-0</code> the whole functionality of
level-0 of EuLisp is given.
</p>
<p>
The file associated with the module <code>takl</code> has to have the name <code>takl.em</code>.
</p>


<pre class="src src-eulisp">(defmodule <span style="color: #0000ff; font-weight: bold;">takl</span>              <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">definition of module takl
</span>    (<span style="color: #0000ff; font-weight: bold;">import</span> (<span style="color: #0000ff; font-weight: bold;">level-0</span>)
     <span style="color: #0000ff; font-weight: bold;">syntax</span> (<span style="color: #0000ff; font-weight: bold;">level-0</span>)
     <span style="color: #0000ff; font-weight: bold;">export</span> (<span style="color: #0000ff; font-weight: bold;">takl</span> gtakl)     <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">export of functions takl and gtakl
</span>     )

  (defun <span style="color: #0000ff; font-weight: bold;">shorterp</span> (<span style="color: #0000ff; font-weight: bold;">x</span> y)      <span style="color: #ff00ff; font-weight: bold;">;</span><span style="color: #ff00ff;">auxiliary function for takl
</span>    (if (<span style="color: #0000ff; font-weight: bold;">null</span> y )            <span style="color: #ff00ff; font-weight: bold;">;</span><span style="color: #ff00ff;">without generic
</span>        ()
      (if  (<span style="color: #0000ff; font-weight: bold;">null</span> x) <span style="font-weight: bold; text-decoration: underline;">t</span>
        (<span style="color: #0000ff; font-weight: bold;">shorterp</span> <span style="color: #0000ff; font-weight: bold;">(cdr</span> x)
                  <span style="color: #0000ff; font-weight: bold;">(cdr</span> y))) ))

  (defun <span style="color: #0000ff; font-weight: bold;">takl</span> (<span style="color: #0000ff; font-weight: bold;">x</span> y z)
    (if (<span style="color: #0000ff; font-weight: bold;">null</span> (<span style="color: #0000ff; font-weight: bold;">shorterp</span> y x))
        z
      (<span style="color: #0000ff; font-weight: bold;">takl</span> (<span style="color: #0000ff; font-weight: bold;">takl</span> <span style="color: #0000ff; font-weight: bold;">(cdr</span> x) y z)
            (<span style="color: #0000ff; font-weight: bold;">takl</span> <span style="color: #0000ff; font-weight: bold;">(cdr</span> y) z x)
            (<span style="color: #0000ff; font-weight: bold;">takl</span> <span style="color: #0000ff; font-weight: bold;">(cdr</span> z) x y))))

<span style="color: #ff00ff; font-weight: bold;">;;;</span><span style="color: #ff00ff;">-----------------------------------------------------------------------------
</span>;;; takl with generic shorterp<span style="color: #ff00ff;">
</span><span style="color: #ff00ff; font-weight: bold;">;;;</span><span style="color: #ff00ff;">-----------------------------------------------------------------------------
</span>  (defgeneric <span style="color: #0000ff; font-weight: bold;">gshorterp</span> ((<span style="color: #0000ff; font-weight: bold;">x</span> <span style="color: #0000ff;">&lt;list&gt;</span>) y)) <span style="color: #ff00ff; font-weight: bold;">;</span><span style="color: #ff00ff;">auxiliary generic function for gtakl
</span>
  (defmethod <span style="color: #0000ff; font-weight: bold;">gshorterp</span> ((<span style="color: #0000ff; font-weight: bold;">x</span> <span style="color: #0000ff;">&lt;null&gt;</span>) y)
    y)

  (defmethod <span style="color: #0000ff; font-weight: bold;">gshorterp</span> ((<span style="color: #0000ff; font-weight: bold;">x</span> <span style="color: #0000ff;">&lt;cons&gt;</span>) y)
    (if (<span style="color: #0000ff; font-weight: bold;">null</span> y)
        ()
      (<span style="color: #0000ff; font-weight: bold;">gshorterp</span> <span style="color: #0000ff; font-weight: bold;">(cdr</span> x) <span style="color: #0000ff; font-weight: bold;">(cdr</span> y))))

  (defun <span style="color: #0000ff; font-weight: bold;">gtakl</span> (<span style="color: #0000ff; font-weight: bold;">x</span> y z)
    (if (<span style="color: #0000ff; font-weight: bold;">null</span> (<span style="color: #0000ff; font-weight: bold;">gshorterp</span> y x))
        z
      (<span style="color: #0000ff; font-weight: bold;">gtakl</span> (<span style="color: #0000ff; font-weight: bold;">gtakl</span> <span style="color: #0000ff; font-weight: bold;">(cdr</span> x) y z)
             (<span style="color: #0000ff; font-weight: bold;">gtakl</span> <span style="color: #0000ff; font-weight: bold;">(cdr</span> y) z x)
             (<span style="color: #0000ff; font-weight: bold;">gtakl</span> <span style="color: #0000ff; font-weight: bold;">(cdr</span> z) x y))))

<span style="color: #ff00ff; font-weight: bold;">;;;</span><span style="color: #ff00ff;">-----------------------------------------------------------------------------
</span>  )                     <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">end of module
</span><span style="color: #ff00ff; font-weight: bold;">;;;</span><span style="color: #ff00ff;">-----------------------------------------------------------------------------
</span></pre>



<p>
The next example shows an interface to C to measure run time of functions
<code>takl</code> and <code>gtakl</code> imported from the module <code>takl</code>. You can see the special
keyword <code>c-import</code> which imports the C-file <code>timing.c</code> contained in the
currend release.  The linking of the C-functions <code>start_timer</code> and <code>timer</code> was
made with help of the form <code>%declare-external-function</code>. In this form the
names of this function in EuLisp and in C and the types for the arguments and
result in C are declared.
</p>
<p>
The file associated with the module <code>test-takl</code> has to have the name
<code>test-takl.em</code>.
</p>



<pre class="src src-eulisp">(defmodule <span style="color: #0000ff; font-weight: bold;">test-takl</span>
    (<span style="color: #0000ff; font-weight: bold;">import</span> (<span style="color: #0000ff; font-weight: bold;">level-0</span>
             (<span style="color: #0000ff; font-weight: bold;">only</span> (<span style="color: #0000ff; font-weight: bold;">%void</span>
                    %string)
                   tail)
             takl)
     <span style="color: #0000ff; font-weight: bold;">syntax</span> (<span style="color: #0000ff; font-weight: bold;">level-0</span>)
     c-import (<span style="color: #00ff00;">"timing.h"</span>)      <span style="color: #ff00ff; font-weight: bold;">;</span><span style="color: #ff00ff;">extension of module syntax
</span>     )

  (defun <span style="color: #0000ff; font-weight: bold;">listn</span> (<span style="color: #0000ff; font-weight: bold;">n</span>)
    (if <span style="color: #0000ff; font-weight: bold;">(=</span> n 0)
        ()
      <span style="color: #0000ff; font-weight: bold;">(cons</span> n (<span style="color: #0000ff; font-weight: bold;">listn</span> <span style="color: #0000ff; font-weight: bold;">(-</span> n 1)))))

  (deflocal <span style="color: #0000ff;">l24</span> (<span style="color: #0000ff; font-weight: bold;">listn</span> 24))
  (deflocal <span style="color: #0000ff;">l18</span> (<span style="color: #0000ff; font-weight: bold;">listn</span> 18))
  (deflocal <span style="color: #0000ff;">l12</span> (<span style="color: #0000ff; font-weight: bold;">listn</span> 12))
  (deflocal <span style="color: #0000ff;">l6</span> (<span style="color: #0000ff; font-weight: bold;">listn</span> 6))

  <span style="color: #ff00ff; font-weight: bold;">;;</span><span style="color: #ff00ff;">declaration of external functions called from EuLisp
</span>  <span style="color: #ff00ff; font-weight: bold;">;;</span><span style="color: #ff00ff;">to measure cpu consumption
</span>  <span style="color: #ff00ff; font-weight: bold;">;;</span><span style="color: #ff00ff;">start_timer sets the first time stamp
</span>  <span style="color: #ff00ff; font-weight: bold;">;;</span><span style="color: #ff00ff;">timer gets a char * string containing format directives
</span>  <span style="color: #ff00ff; font-weight: bold;">;;</span><span style="color: #ff00ff;">to print the values of elapsed user time system time and their sum
</span>  <span style="color: #ff00ff; font-weight: bold;">;;</span><span style="color: #ff00ff;">char* strings has to be  written as Tail-literals in the following
</span>  <span style="color: #ff00ff; font-weight: bold;">;;</span><span style="color: #ff00ff;">form: (%literal %string () "string")
</span>
  (<span style="color: #0000ff; font-weight: bold;">%declare-external-function</span>

    (<span style="color: #0000ff; font-weight: bold;">start-timer</span> %void)          <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">the name of the function is start-timer,
</span>    <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">result of start-timer is void
</span>    ()                           <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">no args
</span>    external-name |start_timer|  <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">the name in C is start_timer
</span>    language <span style="color: #000000;">C</span>)                  <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">the used foreign language is C
</span>
  (<span style="color: #0000ff; font-weight: bold;">%declare-external-function</span>

    (<span style="color: #0000ff; font-weight: bold;">timer</span> %void)                <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">the name of the function is timer
</span>    <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">result of timer is void
</span>    ((<span style="color: #0000ff; font-weight: bold;">string</span> %string))           <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">one arg string of type char *
</span>    external-name |timer|        <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">the name in C is timer
</span>    language <span style="color: #000000;">C</span>)                  <span style="color: #ff00ff; font-weight: bold;">; </span><span style="color: #ff00ff;">the used foreign language is C
</span>
  (deflocal <span style="color: #0000ff;">result</span> ())

  (<span style="color: #0000ff; font-weight: bold;">start-timer</span>)
  (<span style="color: #0000ff; font-weight: bold;">setq</span> result (<span style="color: #0000ff; font-weight: bold;">takl</span> l24 l12 l6))
  (<span style="color: #0000ff; font-weight: bold;">timer</span> (<span style="color: #0000ff; font-weight: bold;">%literal</span> %string () <span style="color: #00ff00;">"\ntakl: %.2f sec (%.2f sec system)"</span>))
  <span style="color: #0000ff; font-weight: bold;">(format</span> <span style="font-weight: bold; text-decoration: underline;">t</span> <span style="color: #00ff00;">"~%(takl l24 l12 l6) -&gt; ~a~%"</span> result)

<span style="color: #ff00ff; font-weight: bold;">;;;</span><span style="color: #ff00ff;">-----------------------------------------------------------------------------
</span>  )
<span style="color: #ff00ff; font-weight: bold;">;;;</span><span style="color: #ff00ff;">-----------------------------------------------------------------------------
</span></pre>



</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <a href="../TODO.html">To Do</a> </h2>
<div class="outline-text-2" id="text-10">

</div>
</div>
<div id="postamble">
<p class="date"> Date: 2010-10-19 20:56:27 BST</p>
<p class="creator">HTML generated by org-mode 7.01trans in emacs 23</p>
</div>
</div>
</body>
</html>
